<template>
  <header class="fixed top-0 left-0 w-full text-black z-50">
    <div class="container mx-auto px-6 max-w-[1200px] md:max-w-[640px] lg:max-w-[1200px]">
      <!-- Верхняя часть -->
      <div class="flex justify-between items-center py-4">
        <!-- Лого и "Ремонт квартир" -->
        <div class="flex items-center space-x-6">
          <svg
            width="124"
            height="22"
            viewBox="0 0 124 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M0.82 2.576V1.736H5.972L14.036 18.872L13.112 21H9.472L0.82 2.576ZM16.64 12.908H16.528L14.652 17.444L12.244 12.292L16.64 1.736H21.96V21H16.64V12.908ZM0.82 5.348L5.972 16.324V21H0.82V5.348Z"
              fill="#2D4872"
            />
            <path
              d="M32.6774 12.152C32.6774 11.6667 32.6588 11.3213 32.6214 11.116C32.5841 10.9107 32.4721 10.7613 32.2854 10.668C32.1174 10.5747 31.8001 10.5093 31.3334 10.472C31.0534 10.4533 30.4468 10.444 29.5134 10.444C28.6174 10.444 27.7868 10.4813 27.0214 10.556L25.5374 10.64V7C27.2921 6.664 29.1868 6.496 31.2214 6.496C32.7894 6.496 34.0121 6.608 34.8894 6.832C35.7854 7.056 36.4574 7.41067 36.9054 7.896C37.2974 8.344 37.5494 8.91333 37.6614 9.604C37.7921 10.2947 37.8574 11.256 37.8574 12.488V21H32.6774V12.152ZM28.5334 21.196C27.2454 21.196 26.2934 20.8413 25.6774 20.132C25.0614 19.404 24.7534 18.312 24.7534 16.856C24.7534 15.96 24.8188 15.2413 24.9494 14.7C25.0801 14.14 25.3041 13.7013 25.6214 13.384C25.9388 13.048 26.3774 12.8147 26.9374 12.684C27.4974 12.5347 28.2348 12.46 29.1494 12.46L31.5014 12.516V15.008H31.2214C30.7921 15.008 30.5121 15.0173 30.3814 15.036C30.0081 15.0547 29.8121 15.232 29.7934 15.568C29.7748 15.68 29.7654 15.9133 29.7654 16.268C29.7654 16.548 29.7748 16.7627 29.7934 16.912C29.8308 17.0613 29.8868 17.1827 29.9614 17.276C30.0548 17.4067 30.1948 17.4813 30.3814 17.5C30.6428 17.5373 30.9228 17.556 31.2214 17.556H31.5014V20.412C31.0908 20.7293 30.6521 20.9347 30.1854 21.028C29.7374 21.14 29.1868 21.196 28.5334 21.196ZM39.7507 6.72H45.4067L55.0387 21H49.3827L39.7507 6.72ZM48.3467 8.96L49.5227 6.72H54.8427L51.0067 12.908L48.3467 8.96ZM43.5867 14.532L46.2467 18.48L44.9027 21H39.5827L43.5867 14.532ZM81.245 7.532C81.637 7.15867 82.0943 6.89733 82.617 6.748C83.1583 6.58 83.821 6.496 84.605 6.496V11.172C83.765 11.172 83.0743 11.228 82.533 11.34C82.0103 11.452 81.581 11.648 81.245 11.928V7.532ZM74.889 6.72H80.069V21H74.889V6.72ZM94.6268 13.888C94.6268 12.936 94.6174 12.3013 94.5988 11.984C94.5801 11.536 94.5241 11.2 94.4308 10.976C94.3374 10.7333 94.1881 10.584 93.9828 10.528C93.7588 10.472 93.4508 10.444 93.0588 10.444H92.6668V6.496H93.0588C94.6828 6.496 95.9521 6.62667 96.8668 6.888C97.7814 7.13067 98.4628 7.54133 98.9108 8.12C99.3214 8.64267 99.5828 9.34267 99.6948 10.22C99.8254 11.0787 99.8908 12.3013 99.8908 13.888C99.8908 15.3627 99.8441 16.5107 99.7508 17.332C99.6761 18.1347 99.4801 18.7973 99.1628 19.32C98.8081 19.8987 98.2761 20.3373 97.5668 20.636C96.8574 20.916 95.8774 21.0933 94.6268 21.168V13.888ZM93.0588 21.224C91.4348 21.224 90.1654 21.1027 89.2508 20.86C88.3361 20.6173 87.6548 20.2067 87.2068 19.628C86.7961 19.1053 86.5254 18.4147 86.3948 17.556C86.2828 16.6973 86.2268 15.4747 86.2268 13.888C86.2268 12.432 86.2734 11.2933 86.3668 10.472C86.4601 9.65067 86.6654 8.96933 86.9828 8.428C87.3188 7.83067 87.8414 7.392 88.5508 7.112C89.2601 6.81333 90.2401 6.62667 91.4908 6.552V13.888C91.4908 14.84 91.5001 15.4653 91.5188 15.764C91.5374 16.212 91.5934 16.548 91.6868 16.772C91.7801 16.996 91.9388 17.136 92.1628 17.192C92.3494 17.248 92.6481 17.276 93.0588 17.276H93.4508V21.224H93.0588ZM120.17 4.508C120.114 4.732 120.086 5.04933 120.086 5.46V6.72H123.502V10.668H101.578V6.72H104.21V6.412C104.21 4.82533 104.322 3.62133 104.546 2.8C104.77 1.97867 105.181 1.38133 105.778 1.008C106.338 0.653332 107.113 0.429332 108.102 0.335999C109.092 0.242666 110.66 0.195999 112.806 0.195999V3.78C111.836 3.78 111.201 3.78933 110.902 3.808C110.454 3.82667 110.109 3.892 109.866 4.004C109.642 4.116 109.512 4.284 109.474 4.508C109.418 4.732 109.39 5.04933 109.39 5.46V6.72H114.906V6.412C114.906 4.82533 115.018 3.62133 115.242 2.8C115.466 1.97867 115.877 1.38133 116.474 1.008C117.034 0.653332 117.809 0.429332 118.798 0.335999C119.788 0.242666 121.356 0.195999 123.502 0.195999V3.78C122.532 3.78 121.897 3.78933 121.598 3.808C121.15 3.82667 120.805 3.892 120.562 4.004C120.338 4.116 120.208 4.284 120.17 4.508ZM104.21 11.788H109.39V21H104.21V11.788ZM114.906 11.788H120.086V21H114.906V11.788Z"
              fill="black"
            />
            <path
              d="M57.0661 1.736H62.6661V21H57.0661V1.736ZM63.8421 10.724H64.5141C65.1114 10.724 65.5501 10.7053 65.8301 10.668C66.1288 10.612 66.3621 10.5 66.5301 10.332C66.6981 10.1827 66.8008 9.968 66.8381 9.688C66.8941 9.38933 66.9221 8.95067 66.9221 8.372C66.9221 7.79333 66.8941 7.364 66.8381 7.084C66.8008 6.78533 66.6981 6.552 66.5301 6.384C66.3621 6.23467 66.1288 6.14133 65.8301 6.104C65.5314 6.048 65.0928 6.02 64.5141 6.02H63.8421V1.736H66.1661C67.5474 1.736 68.6674 1.876 69.5261 2.156C70.4034 2.41733 71.0661 2.828 71.5141 3.388C71.9434 3.91067 72.2328 4.57333 72.3821 5.376C72.5314 6.16 72.6061 7.15867 72.6061 8.372C72.6061 9.52933 72.5314 10.4907 72.3821 11.256C72.2514 12.0213 71.9808 12.6653 71.5701 13.188C71.1034 13.7853 70.4314 14.2427 69.5541 14.56C68.6954 14.8587 67.5661 15.008 66.1661 15.008H63.8421V10.724Z"
              fill="#6CAC3D"
            />
          </svg>

          <ul class="pl-12 hidden md:flex space-x-6 text-black">
            <li v-for="link in navLinks" :key="link.name">
              <a :href="link.href" class="hover:text-hoverBlack transition">
                {{ link.name }}
              </a>
            </li>
          </ul>
        </div>

        <!-- Контакты -->
        <div class="hidden md:flex items-center space-x-4">
          <div>
            <div class="flex items-center">
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M10.9104 4.05809C11.6586 4.20378 12.3462 4.56898 12.8852 5.10696C13.4242 5.64494 13.7901 6.33121 13.9361 7.07795L10.9104 4.05809ZM10.9104 1C12.4648 1.17235 13.9143 1.8671 15.0209 2.97018C16.1275 4.07326 16.8254 5.5191 17 7.0703L10.9104 1ZM16.234 13.1712V15.4648C16.2349 15.6777 16.1912 15.8884 16.1057 16.0835C16.0203 16.2786 15.8949 16.4537 15.7377 16.5977C15.5805 16.7416 15.3949 16.8512 15.1928 16.9194C14.9908 16.9876 14.7766 17.013 14.5642 16.9938C12.2071 16.7382 9.94297 15.9343 7.95371 14.6467C6.10295 13.4729 4.53384 11.9068 3.35779 10.0596C2.06326 8.0651 1.25765 5.79431 1.00622 3.43118C0.987076 3.21976 1.01225 3.00669 1.08014 2.80551C1.14802 2.60434 1.25713 2.41948 1.40052 2.2627C1.54391 2.10592 1.71843 1.98066 1.91298 1.89489C2.10753 1.80912 2.31785 1.76472 2.53053 1.76452H4.82849C5.20022 1.76087 5.56061 1.89226 5.84247 2.13419C6.12433 2.37613 6.30843 2.71211 6.36046 3.0795C6.45745 3.81349 6.63732 4.53418 6.89665 5.22781C6.99971 5.50145 7.02201 5.79884 6.96092 6.08474C6.89983 6.37065 6.7579 6.63308 6.55195 6.84095L5.57915 7.81189C6.66958 9.7259 8.25739 11.3107 10.1751 12.399L11.1479 11.4281C11.3561 11.2225 11.6191 11.0809 11.9055 11.0199C12.192 10.9589 12.4899 10.9812 12.7641 11.084C13.4591 11.3429 14.1811 11.5224 14.9165 11.6192C15.2886 11.6716 15.6284 11.8587 15.8713 12.1448C16.1143 12.431 16.2433 12.7962 16.234 13.1712Z"
                  stroke="black"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />
              </svg>

              <h2 class="text-h2 text-black font-bold">+7 702 641 44 12</h2>
            </div>

            <h3 class="text-h3 text-black font-normal">08:00 - 22:00, без выходных</h3>
          </div>
          <button
            class="border border-primary text-primary px-4 py-2 rounded-md hover:bg-buttonHover hover:text-white transition"
          >
            Заказать звонок
          </button>
        </div>

        <!-- Бургер-меню для мобильных -->
        <button class="md:hidden text-black">☰</button>
      </div>
    </div>

    <!-- Горизонтальный разделитель -->
    <hr class="mx-auto border-t border-primary max-w-[1155px] md:max-w-[640px] lg:max-w-[1155px]" />

    <!-- Нижняя часть с меню услуг -->
    <div class="w-full pr-11 ">
      <div
        class="container mx-auto flex justify-around py-3 max-w-[1200px] md:max-w-[640px] lg:max-w-[1200px]"
      >
        <div v-for="item in menuItems" :key="item.name" class="relative">
          <button
            @click="toggleDropdown(item.key)"
            class="flex items-center h-full py-2 px-3 w-full justify-between dropdown-button font-medium"
            :class="{
              'bg-buttonActive border-primary': dropdowns[item.key]
            }"
          >
            {{ item.name }}
            <svg
              v-if="item.dropdown"
              class="pt-1"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M6 9L12 15L18 9"
                stroke="#171616"
                stroke-width="2"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </button>

          <!-- Выпадающее меню -->
          <ul
            v-if="dropdowns[item.key]"
            class="absolute left-1/2 -translate-x-1/2 mt-4 w-[218px] rounded-lg shadow-md animate-fade-in dropdown-menu"
          >
            <li v-for="subItem in item.dropdown" :key="subItem" class="px-10 py-2 gap-5 transition">
              <a
                href="#"
                class="inline-block border border-transparent px-2 hover:border-primary rounded-md transition"
              >
                {{ subItem }}
              </a>
            </li>
          </ul>
        </div>
      </div>
    </div>
    <hr
      class="mx-auto border-t border-primary max-w-[1155px] md:max-w-[640px] lg:max-w-[1155px]"
    />
  </header>
</template>

<script setup>
import { ref, onMounted, onBeforeUnmount } from 'vue'

const navLinks = [
  { name: 'Цены', href: '#' },
  { name: 'Услуги', href: '#' },
  { name: 'Портфолио', href: '#' },
  { name: 'Акции', href: '#' },
  { name: 'Преимущества', href: '#' },
  { name: 'Блог', href: '#' },
  { name: 'Контакты', href: '#' }
]

const menuItems = [
  {
    name: 'Ремонт квартир',
    key: 'repair',
    dropdown: [
      'Черновой',
      'Косметический',
      'Капитальный',
      'Элитный',
      'В новостройках',
      'Студии',
      'Вторичное жилье'
    ]
  },
  {
    name: 'Дизайн интерьера',
    key: 'design',
    dropdown: [
      'Дизайн кухни',
      'Дизайн спальни',
      'Дизайн гостиной',
      'Дизайн детской',
      'Дизайн санузла',
      'Дизайн коридора',
      'Дизайн балкона'
    ]
  },
  {
    name: 'Ремонт комнат',
    key: 'rooms',
    dropdown: ['Кухни', 'Спальни', 'Гостиная', 'Детские', 'Санузлы', 'Коридоры', 'Балконы']
  },
  {
    name: 'Дома и коттеджи',
    key: 'houses'
  },
  {
    name: 'Прочие услуги',
    key: 'other'
  }
]

const dropdowns = ref({})
const toggleDropdown = (key) => {
  for (let k in dropdowns.value) {
    if (k === key && dropdowns.value[k]) {
      dropdowns.value[k] = false
      return
    }

    dropdowns.value[k] = false
  }

  dropdowns.value[key] = true
}

const closeDropdowns = (event) => {
  if (!event.target.closest('.dropdown-menu') && !event.target.closest('.dropdown-button')) {
    dropdowns.value = {}
  }
}

onMounted(() => {
  document.addEventListener('click', closeDropdowns)
})

onBeforeUnmount(() => {
  document.removeEventListener('click', closeDropdowns)
})
</script>

<style scoped>
.animate-fade-in {
  animation: fadeIn 0.3s ease-in-out;
}
.button-active {
  background-color: #52971f; /* Зелёный цвет при активации */
  border-color: #52971f; /* Цвет границы при активации */
}
</style>
